In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                 'Name':['Python','C','Java','Oracle']
                 })
df2=pd.DataFrame({'ID':[1,2,3,4],
                 'Price':[600,300,350,325]
                 })

In [3]:
mer=pd.merge(df1,df2)

In [4]:
mer

   ID    Name  Price
0   1  Python    600
1   2       C    300
2   3    Java    350
3   4  Oracle    325

In [18]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                 'Name':['Python','C','Java','Oracle']
                 },index=[10,11,12,13])
df2=pd.DataFrame({'ID':[1,4,5,6],
                 'Price':[600,300,350,325]
                 },index=[14,15,16,17])

In [23]:
df1

    ID    Name
10   1  Python
11   2       C
12   3    Java
13   4  Oracle

In [24]:
df2

    ID  Price
14   1    600
15   4    300
16   5    350
17   6    325

In [19]:
mer1=pd.merge(df1,df2)

In [20]:
mer1

   ID    Name  Price
0   1  Python    600
1   4  Oracle    300

In [25]:
mer2=pd.merge(df1,df2,how='outer')

In [26]:
mer2

   ID    Name  Price
0   1  Python  600.0
1   2       C    NaN
2   3    Java    NaN
3   4  Oracle  300.0
4   5     NaN  350.0
5   6     NaN  325.0

In [17]:
mer3=pd.merge(df1,df2,on='ID')

In [13]:
mer3

   ID    Name  Price
0   1  Python    600
1   4  Oracle    300

In [63]:
d = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
 'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
d

d1 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
 'A': ['A0', 'A1', 'A2']})
d1

  key   A
0  K0  A0
1  K1  A1
2  K2  A2

In [64]:
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
'B': ['B0', 'B1', 'B2']})
other

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [52]:
# join
#d1.join(other)

print(type(other['B'][0]))

<class 'str'>

In [73]:
d1.join(other,rsuffix="_")

  key   A key_   B
0  K0  A0   K0  B0
1  K1  A1   K1  B1
2  K2  A2   K2  B2